PrmBRana/STM32WL55JC1_GMSK_CW_TEST_M0-_PC2_PA/Main_code/Main_Satellite/satellite_app.c
/*
 * ============================================================================
 * LOW-LEVEL HARDWARE INITIALIZATION (CPU2 / CORTEX-M0+ DOMAIN)
 * ============================================================================
 */

/**
 * @brief  Point Cortex-M0+ Vector Table Offset Register (VTOR) to CPU2 Flash base.
 * @note   CPU2 firmware binary is located at 0x08032000 in Dual-Core Flash layout.
 */
void Satellite_Init_VectorTable(void) {
    SCB->VTOR = SATELLITE_CPU2_VECTOR_TABLE_ADDR;
    __DSB();
    __ISB();
}

/**
 * @brief  Enable all required peripheral bus clocks in the CPU2 (Cortex-M0+) domain.
 *         Uses standard CMSIS RCC register definitions:
 *         - RCC->C2AHB2ENR: GPIO Ports A, B, C, and H
 *         - RCC->C2AHB3ENR: IPCC, Flash interface, HSEM
 *         - RCC->C2APB2ENR: USART1 debug console
 *         - RCC->C2APB3ENR: SUBGHZSPI radio interface
 */
void Satellite_Init_PeripheralClocks(void) {
    /* 1. Enable GPIOA, GPIOB, GPIOC, GPIOH clocks in CPU2 domain (AHB2: 0x5800014C |= 0x87) */
    RCC->C2AHB2ENR |= (RCC_C2AHB2ENR_GPIOAEN |
                       RCC_C2AHB2ENR_GPIOBEN |
                       RCC_C2AHB2ENR_GPIOCEN |
                       RCC_C2AHB2ENR_GPIOHEN);

    /* 2. Enable IPCC, Flash interface, and HSEM clocks in CPU2 domain (AHB3: 0x58000150 |= (1<<0) | (1<<25)) */
    (*(volatile uint32_t *)0x58000150UL) |= (1UL << 0) | (1UL << 25);
    RCC->C2AHB3ENR |= (RCC_C2AHB3ENR_IPCCEN  |
                       RCC_C2AHB3ENR_FLASHEN |
                       RCC_C2AHB3ENR_HSEMEN);

    /* 3. Enable USART1 bus clock in CPU2 domain (APB2: 0x58000160 |= (1<<14)) */
    RCC->C2APB2ENR |= RCC_C2APB2ENR_USART1EN;

    /* 4. Enable SUBGHZSPI radio SPI interface bus clock in CPU2 domain (APB3) */
    RCC->C2APB3ENR |= RCC_C2APB3ENR_SUBGHZSPIEN;
}

/**
 * @brief  Disable and mask IPCC (Inter-Processor Communication Controller) interrupts
 *         in CPU2 domain to prevent unhandled mailbox IRQs from trapping the CPU2 core.
 */
void Satellite_Init_IPCC_Isolation(void) {
    /* Clear CPU2 control register: disable RX occupied and TX free interrupt generation (0x58000C10) */
    IPCC->C2CR = 0x00000000;

    /* Mask all 6 bidirectional mailbox channels for CPU2 (0x58000C14) */
    IPCC->C2MR = 0xFFFFFFFF;

    /* Disable IRQ1 (vector position 1 in startup_cm0p.s: IPCC_C2_RX_C2_TX) and CMSIS IRQ 18 */
    NVIC_DisableIRQ((IRQn_Type)1);
    NVIC_DisableIRQ(IPCC_C2_RX_C2_TX_IRQn);
}

/**
 * @brief  Complete low-level CPU2 hardware initialization sequence:
 *         1. Relocates vector table to CPU2 flash base
 *         2. Enables peripheral bus clocks in CPU2 domain
 *         3. Isolates IPCC inter-core interrupts
 */
void Satellite_Hardware_Init(void) {
    Satellite_Init_VectorTable();
    Satellite_Init_PeripheralClocks();
    Satellite_Init_IPCC_Isolation();
}

void Satellite_Init(const SatelliteConfig_t *config) {
    Satellite_SetConfig(config);

    if (s_config.rfSwitchConfig == 0) {
        s_config.rfSwitchConfig = SAT_CFG_DEFAULT_RF_SWITCH;
    }

    uint32_t uart_delay = (s_config.uartSettleDelayMs > 0) ? s_config.uartSettleDelayMs : 50;
    int8_t   tx_power   = (s_config.txPowerDbm != 0) ? s_config.txPowerDbm : RADIO_TX_POWER_DBM;
    uint32_t bitrate    = (s_config.bitrateBps > 0) ? s_config.bitrateBps : RADIO_BIT_RATE_BPS;
    uint32_t fdev       = (s_config.fdevHz > 0) ? s_config.fdevHz : RADIO_FDEV_HZ;

    /* 1. Ensure low-level hardware, vector table, and peripheral clocks are initialized */
    Satellite_Hardware_Init();

    /* 2. Initialize USART1 immediately so console is alive */
    uart1_init();

    /* 3. Core architecture & peripheral clock init */
    SystemInit();
    HAL_Init();
    SysTick_Init_CPU2(HAL_RCC_GetHCLK2Freq());

    CPU2_Delay_Ms(uart_delay); /* Allow UART line voltage to settle */

    /* 7. Structured M0+ Initialization Logs */
    uart1_puts("\r\n\r\n");
    uart1_puts("======================================================================\r\n");
    uart1_puts("     STM32WL55 CORTEX-M0+ SATELLITE RADIO SYSTEM INITIALIZING         \r\n");
    uart1_puts("======================================================================\r\n");
    uart1_puts("[INIT] 1. SystemCoreClock & HAL Base Initialized .......... [OK]\r\n");
    uart1_printf("[INIT] 2. CPU2 SysTick Timer Started (%lu MHz) .............. [OK]\r\n",
                 (unsigned long)(HAL_RCC_GetHCLK2Freq() / 1000000UL));
    uart1_puts("[INIT] 3. USART1 Console Initialized (PA9 TX / PA10 RX @ 115200) .. [OK]\r\n");

    RBI_Init();
    Satellite_SetRFSwitch(RBI_SWITCH_OFF);
    uart1_printf("[INIT] 4. RF Front-End Switch & 3.3V PA Configured: %s (Standby: OFF) ... [OK]\r\n",
                 (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? "RBI_SWITCH_RFO_HP" : "RBI_SWITCH_RFO_LP");

    MX_SUBGHZ_Init();
    HAL_NVIC_SetPriority(SUBGHZ_Radio_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(SUBGHZ_Radio_IRQn);
    __enable_irq();
    uart1_puts("[INIT] 5. Sub-GHz Radio (SX1262) & NVIC IRQs Enabled ...... [OK]\r\n");

    static RadioEvents_t s_sat_radio_events = {
        .TxDone = OnTxDone,
        .TxTimeout = OnTxTimeout,
        .RxDone = OnRxDone,
        .RxTimeout = OnRxTimeout,
        .RxError = OnRxError
    };

    RadioApp_Init(&s_config.radio, &s_sat_radio_events);
    RadioApp_SetTxPower(tx_power);
    RadioApp_SetPaSelect((s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? RFO_HP : RFO_LP);
    uart1_puts("[INIT] 6. Radio Application Layer Configured:              [OK]\r\n");
    uart1_printf("       - Downlink Frequency : %lu.%03lu MHz\r\n",
                 (unsigned long)(s_config.radio.txFrequency / 1000000UL),
                 (unsigned long)((s_config.radio.txFrequency % 1000000UL) / 1000UL));
    uart1_printf("       - Transmit RF Power  : +%d dBm\r\n", tx_power);
    uart1_printf("       - RF Front-End Switch: %s\r\n",
                 (s_config.rfSwitchConfig == RBI_SWITCH_RFO_HP) ? "RBI_SWITCH_RFO_HP (High Power)" : "RBI_SWITCH_RFO_LP (Low Power)");
    uart1_printf("       - GMSK Bitrate       : %lu bps (Fdev: %lu Hz, BT: 0.5)\r\n",
                 (unsigned long)bitrate, (unsigned long)fdev);
    uart1_printf("       - Callsign Profile   : %s-%d -> %s-%d\r\n",
                 s_config.radio.sourceCallsign, s_config.radio.sourceSSID,
                 s_config.radio.destCallsign, s_config.radio.destSSID);
    uart1_puts("       - Supported Modes    : 1) CW Morse Beacon (Keying)\r\n");
    uart1_puts("                              2) GMSK AX.25 UI Frame + G3RUH\r\n");
    uart1_puts("======================================================================\r\n");
    uart1_puts("[INIT COMPLETE] Satellite Application Ready.\r\n");
    uart1_puts("======================================================================\r\n\r\n");
}

